export const FaqData = [
  {
    question: "Τι είναι το PharmaFinder και πώς μπορεί να με βοηθήσει;",
    answer:
      "Το PharmaFinder είναι μια εφαρμογή που σας βοηθά να βρείτε φαρμακεία στην περιοχή σας. Χρησιμοποιεί τις υπηρεσίες τοποθεσίας της συσκευής σας ή την διεύθυνση IP σας για να εντοπίσει τα κοντινά φαρμακεία, καθώς προσφέρει επίσης τη δυνατότητα αναζήτησης εφημερεύοντων φαρμακείων σε μια πόλη ή περιοχή της επιλογής σας.",
  },
  {
    question:
      "Πρέπει να ενεργοποιήσω τις υπηρεσίες τοποθεσίας στη συσκευή μου για να χρησιμοποιήσω το PharmaFinder;",
    answer:
      "Ενώ η ενεργοποίηση των υπηρεσιών τοποθεσίας βελτιώνει την ακρίβεια των αποτελεσμάτων, δεν είναι απαραίτητη. Αν δεν θέλετε να τις χρησιμοποιήσετε, η εφαρμογή θα χρησιμοποιήσει την διεύθυνση IP σας για να εντοπίσει μια προσεγγιστική τοποθεσία.",
  },
  {
    question:
      "Ενώ έχω επιτρέψει τις υπηρεσίες τοποθεσίας, η τοποθεσία μου δεν είναι σωστή. Τι μπορώ να κάνω;",
    answer:
      "Εάν η τοποθεσία σας δεν είναι σωστή, μπορείτε να την αλλάξετε χειροκίνητα σέρνοντας την πινέζα στο χάρτη στην επιθυμητή θέση. Επίσης, μπορείτε να αναζητήσετε φαρμακεία σε μια περιοχή της επιλογής σας χωρίς να ενεργοποιήσετε τις υπηρεσίες τοποθεσίας.",
  },
  {
    question: "Πώς μπορώ να αναζητήσω φαρμακεία στο PharmaFinder;",
    answer:
      'Μπορείτε να αναζητήσετε φαρμακεία είτε με την λειτουργία "Κοντά μου" είτε αναζητώντας βάσει του ονόματος μιας περιοχής ή πόλης.',
  },
  {
    question:
      "Μπορώ να επιλέξω την ακτίνα αναζήτησης στο PharmaFinder; Ποια είναι η προεπιλεγμένη ακτίνα αναζήτησης;",
    answer:
      "Ναι, μπορείτε να ρυθμίσετε την ακτίνα αναζήτησης από 1 έως 10 χιλιόμετρα. Η προεπιλεγμένη ακτίνα αναζήτησης είναι τα 3 χιλιόμετρα.",
  },
  {
    question:
      "Πώς ορίζω τον χρόνο που χρειάζομαι ένα φαρμακείο στο PharmaFinder;",
    answer:
      "Μπορείτε να επιλέξετε ανάμεσα στις επιλογές 'Τώρα', 'Σήμερα', ή 'Αύριο' για να βρείτε φαρμακεία που είναι ανοιχτά κατά την επιλεγμένη ώρα.",
  },
  {
    question:
      "Τι πληροφορίες παρέχονται στα αποτελέσματα αναζήτησης του PharmaFinder;",
    answer:
      "Στα αποτελέσματα αναζήτησης, θα δείτε το όνομα του φαρμακείου, τη διεύθυνσή του, την απόσταση από εσάς (εάν έχετε ενεργοποιήσει τις υπηρεσίες τοποθεσίας), τον αριθμό τηλεφώνου, την ώρα και την ημερομηνία που εφημερεύει.",
  },
  {
    question:
      "Πώς μπορώ να λάβω οδηγίες για ένα φαρμακείο μέσω του PharmaFinder;",
    answer:
      "Επιλέγοντας ένα φαρμακείο από τα αποτελέσματα, ο χάρτης σας οδηγεί στην διεύθυνση του φαρμακείου. Από εκεί, μπορείτε είτε να λάβετε οδηγίες μέσω του Google Maps είτε να δείτε τον προορισμό σας στο Street View.",
  },
] as const;
