import React from "react";
import { FaCalendarAlt, FaListAlt } from "react-icons/fa";
import { FaLocationDot } from "react-icons/fa6";
import { RiPinDistanceFill } from "react-icons/ri";

export const howItWorks = [
  {
    icon: React.createElement(FaLocationDot, {
      className: "block h-full w-full text-gray-200",
    }),
    text: "Ξεκινήστε ενεργοποιώντας τις υπηρεσίες τοποθεσίας σας για να εντοπίσετε φαρμακεία στην περιοχή σας. Αν δεν θέλετε να χρησιμοποιήσετε τις υπηρεσίες τοποθεσίας της συσκευής σας, δεν υπάρχει πρόβλημα! Θα καθορίσουμε αυτόματα μια προσεγγιστική τοποθεσία βάσει της διεύθυνσης IP σας. Εναλλακτικά, μπορείτε να εισάγετε χειροκίνητα το όνομα οποιασδήποτε πόλης στην Ελλάδα για να βρείτε φαρμακεία σε αυτήν την περιοχή.",
  },
  {
    icon: React.createElement(RiPinDistanceFill, {
      className: "block h-full w-full text-gray-200",
    }),
    text: 'Υπάρχουν δύο τρόποι λειτουργίας για να αναζητήσετε φαρμακεία. Είτε κοντά σας, είτε ανα όνομα περιοχής/πόλης. Αν είστε στην λειτουργία "Κοντά μου", τότε μπορείτε να ρυθμίσετε την ακτίνα αναζήτησης, από 1 έως 10 χλμ. με προεπιλεγμένη τιμή τα 3 χλμ.',
  },
  {
    icon: React.createElement(FaCalendarAlt, {
      className: "block h-full w-full text-gray-200",
    }),
    text: 'Προσδιορίστε πότε χρειάζεστε το φαρμακείο. Επιλέξτε μεταξύ των επιλογών "Τώρα", "Σήμερα" ή "Αύριο" για να βρείτε τα φαρμακεία που είναι ανοιχτά την επιλεγμένη ώρα.',
  },
  {
    icon: React.createElement(FaListAlt, {
      className: "block h-full w-full text-gray-200",
    }),
    text: "Τα αποτελέσματα εμφανίζονται στην λίστα δίπλα σας. Σε κάθε αποτελέσματα βλέπετε το όνομα του φαρμακείου, την διεύθυνσή του, την απόσταση του από εσάς (προυποθέτει την ενεργοποίηση των υπηρεσιών τοποθεσίας στην συσκευή σας), τον αριθμό τηλεφώνου του και την ώρα που εφημερεύει. Με την επιλογή του φαρμακείου, ο χάρτης σας οδηγεί στην διεύθυνση του στο οποίο από εκεί μπορείτε είτε να λάβετε οδηγίες μέσω του Google Maps, είτε να δείτε στο Street View τον προορισμό σας.",
  },
] as const;
